In [166]:
# Import Libraries
import pandas as pd
from pathlib import Path
%matplotlib inline

In [167]:
# Check the current directory where the Python program is executing from
print(f"Current Working Directory: {Path.cwd()}")

Current Working Directory: /Users/wilsonquizhpi/Homework-unite-4

In [168]:
# Read CSV
sp500_history_path = Path('sp500_history.csv')
algo_returns_path = Path('algo_returns.csv')
whale_retuns_path = Path('whale_returns.csv')

In [189]:
# Read in data and index by Date
sp500_history_df = pd.read_csv(sp500_history_path, index_col="Date")
sp500_history_df.head()

              Close
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06

In [190]:
# Replacing the name Close to S&P 500 so we can have a good name
sp500_history_df.rename(columns={'Close': 'S&P 500'}, inplace=True)
sp500_history_df.head()

            S&P 500
Date
23-Apr-19  $2933.68
22-Apr-19  $2907.97
18-Apr-19  $2905.03
17-Apr-19  $2900.45
16-Apr-19  $2907.06

In [197]:
# dropping the $ sing because it does not allow to work becuase it is a string
sp500_history_df['S&P 500'] = sp500_history_df['S&P 500'].str.replace("$", " ")
sp500_history_df.head()

/var/folders/yw/s7_xdw_d6p9231wbk6jwlsvm0000gn/T/ipykernel_1400/1184482069.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  sp500_history_df['S&P 500'] = sp500_history_df['S&P 500'].str.replace("$", " ")

            S&P 500
Date
23-Apr-19   2933.68
22-Apr-19   2907.97
18-Apr-19   2905.03
17-Apr-19   2900.45
16-Apr-19   2907.06

In [198]:
# going to string to float 
sp500_history_df['S&P 500'] = sp500_history_df['S&P 500'].astype('float')
sp500_history_df.head()

           S&P 500
Date
23-Apr-19  2933.68
22-Apr-19  2907.97
18-Apr-19  2905.03
17-Apr-19  2900.45
16-Apr-19  2907.06

In [199]:
# Changing the daate fromat
from datetime import datetime
sp500_history_df.index = pd.to_datetime(sp500_history_df.index)
sp500_history_df.index = sp500_history_df.index.strftime('%y/%m/%d')
sp500_history_df.head()

          S&P 500
Date
19/04/23  2933.68
19/04/22  2907.97
19/04/18  2905.03
19/04/17  2900.45
19/04/16  2907.06

In [200]:
# Read in data and index by Date
algo_returns_df = pd.read_csv(algo_returns_path, index_col="Date")
algo_returns_df.head()

              Algo 1  Algo 2
Date
2014-05-28  0.001745     NaN
2014-05-29  0.003978     NaN
2014-05-30  0.004464     NaN
2014-06-02  0.005692     NaN
2014-06-03  0.005292     NaN

In [217]:
# Check for nulls
algo_returns_df.isnull().sum
#Drop missing values
algo_returns_df = algo_returns_df.dropna()
# Rechecking
algo_returns_df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of           Algo 1  Algo 2
Date
14/06/05   False   False
14/06/06   False   False
14/06/09   False   False
14/06/10   False   False
14/06/11   False   False
...          ...     ...
19/04/25   False   False
19/04/26   False   False
19/04/29   False   False
19/04/30   False   False
19/05/01   False   False

[1235 rows x 2 columns]>

In [201]:
# Changing the daate fromat
from datetime import datetime
algo_returns_df.index = pd.to_datetime(algo_returns_df.index)
algo_returns_df.index = algo_returns_df.index.strftime('%y/%m/%d')
algo_returns_df.head()

            Algo 1  Algo 2
Date
14/05/28  0.001745     NaN
14/05/29  0.003978     NaN
14/05/30  0.004464     NaN
14/06/02  0.005692     NaN
14/06/03  0.005292     NaN

In [202]:
# Calculate daily returns
sp500_history_return = sp500_history_df.pct_change()
sp500_history_return.head()

           S&P 500
Date
19/04/23       NaN
19/04/22 -0.008764
19/04/18 -0.001011
19/04/17 -0.001577
19/04/16  0.002279

In [214]:
# Check for nulls
sp500_history_df.isnull().sum
#Drop missing values
sp500_history_df = sp500_history_df.dropna()
# Rechecking
sp500_history_df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of           S&P 500
Date
19/04/23    False
19/04/22    False
19/04/18    False
19/04/17    False
19/04/16    False
...           ...
12/10/05    False
12/10/04    False
12/10/03    False
12/10/02    False
12/10/01    False

[1649 rows x 1 columns]>

In [203]:
# Read in data and index by Date
whale_retuns_df = pd.read_csv(whale_retuns_path, index_col="Date")
whale_retuns_df.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-02,NaN,NaN,NaN,NaN
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098

In [218]:
# Check for nulls
whale_retuns_df.isnull().sum
#Drop missing values
whale_retuns_df = whale_retuns_df.dropna()
# Rechecking 
whale_retuns_df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of           SOROS FUND MANAGEMENT LLC  PAULSON & CO.INC.   \
Date
15/03/03                      False               False
15/03/04                      False               False
15/03/05                      False               False
15/03/06                      False               False
15/03/09                      False               False
...                             ...                 ...
19/04/25                      False               False
19/04/26                      False               False
19/04/29                      False               False
19/04/30                      False               False
19/05/01                      False               False

          TIGER GLOBAL MANAGEMENT LLC  BERKSHIRE HATHAWAY INC
Date
15/03/03                        False                   False
15/03/04                        False                   False
15/03/05                        False                   False
15/03/06                        False                   False
15/03/09                        False                   False
...                               ...                     ...
19/04/25                        False                   False
19/04/26                        False                   False
19/04/29                        False                   False
19/04/30                        False                   False
19/05/01                        False                   False

[1059 rows x 4 columns]>

In [219]:
# Changing the daate fromat
from datetime import datetime
whale_retuns_df.index = pd.to_datetime(whale_retuns_df.index)
whale_retuns_df.index = whale_retuns_df.index.strftime('%y/%m/%d')
whale_retuns_df.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
03/03/15,-0.001266,-0.004981,-0.000496,-0.006569
04/03/15,0.002230,0.003241,-0.002534,0.004213
05/03/15,0.004016,0.004076,0.002355,0.006726
06/03/15,-0.007905,-0.003574,-0.008481,-0.013098
09/03/15,0.000582,0.004225,0.005843,-0.001652

In [221]:
# Join sp500_history_return, whale_retuns_df, and algo_returns_df full datasets by axis
jjoined_data_rows = pd.concat([whale_retuns_df, algo_returns_df, sp500_history_return], axis="columns", join="inner")
jjoined_data_rows.head()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC,Algo 1,Algo 2,S&P 500
Date,,,,,,,
16/03/15,0.007901,0.003583,0.007953,0.008055,0.005307,-0.011584,-0.005569
17/03/15,0.002142,0.002928,-0.000687,0.000384,0.005472,0.012231,0.001629
18/03/15,0.009603,0.007513,0.009557,0.007854,-0.009779,-0.001499,-0.001701
19/03/15,-0.000778,-0.002554,-0.002925,0.002363,0.001960,0.003873,-0.003692
15/04/15,0.004756,0.001753,0.003754,0.004872,-0.003747,0.007683,0.000779